Console.WriteLine("Веддите номер четверти: ");
int x = int.Parse(Console.ReadLine());


if (x==1) Console.WriteLine (" положительным Х(от 1 до бесконечности) и У (от 1 до бесконечности");
if (x==2) Console.WriteLine ("Точка принадлежит ко второй четверти графика (положительным Х от 1 до бесконечности) и отрицательный У от -1 до минус бесконечности)");
if (x==3) Console.WriteLine ("Точка принадлежит к третьей четверти графика (отрицательным  Х от -1 до минус бесконечности и У от -1 )");
if (x==4) Console.WriteLine ("Точка принадлежит к четвертой четверти графика (отрицательный Х от -1 и  положительный У от +1)");